In [8]:
import numpy as np
import pandas as pd

In [20]:
data={'names':['Kim','Lee','Choi','Park'],
     'points':[50,60,75,70],
     'years':[2017,2016,2017,2018]}
print(data)
df=pd.DataFrame(data)
print()
print(df)
print(df.name)
print(df.index.name)
print(df.columns)
df.columns.name='Info'
df.index.name='Num'
print(df)

{'names': ['Kim', 'Lee', 'Choi', 'Park'], 'points': [50, 60, 75, 70], 'years': [2017, 2016, 2017, 2018]}

  names  points  years
0   Kim      50   2017
1   Lee      60   2016
2  Choi      75   2017
3  Park      70   2018

AttributeError: 'DataFrame' object has no attribute 'name'

In [22]:
df

  names  points  years
0   Kim      50   2017
1   Lee      60   2016
2  Choi      75   2017
3  Park      70   2018

In [9]:
data={'name':['Kim','Lee','Park','Hong','Park'],
     'year':[2014,2015,2016,2015,2016],
     'points':[1.5,1.7,3.6,2.4,2.9]}
df=pd.DataFrame(data)
df
df2=pd.DataFrame(data, columns=['year','name','points','penalty'],\
                index=['one','two','three','four','five'])
df2.penalty=[0.1,1.2,0.3,0.4,0.5]
df2['penalty']=1.0
df2['zero']=0
df2

       year  name  points  penalty  zero
one    2014   Kim     1.5      1.0     0
two    2015   Lee     1.7      1.0     0
three  2016  Park     3.6      1.0     0
four   2015  Hong     2.4      1.0     0
five   2016  Park     2.9      1.0     0

In [10]:
print(df2.loc['two':,'year':'points'])

       year  name  points
two    2015   Lee     1.7
three  2016  Park     3.6
four   2015  Hong     2.4
five   2016  Park     2.9

In [39]:
#df.penalty=[0.1,0.2,0.3,0.4,0.5]
#df2['height_point']=df2.points>2.0
#df2
#val=pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
#df2['aaa']=val
#df2['bbb']=0.3
df2.bbb=[1,2,3,4,5]
#df2['bbb']=3
#del df2['zero']
#del df2['height_point']
#del df2['aaa']
del df2['bbb']
df2

       year  name  points  penalty
one    2014   Kim     1.5      1.0
two    2015   Lee     1.7      1.0
three  2016  Park     3.6      1.0
four   2015  Hong     2.4      1.0
five   2016  Park     2.9      1.0

In [41]:
df2.loc['six']=[2013,'Jun',4.3,2.0]
df2

       year  name  points  penalty
one    2014   Kim     1.5      1.0
two    2015   Lee     1.7      1.0
three  2016  Park     3.6      1.0
four   2015  Hong     2.4      1.0
five   2016  Park     2.9      1.0
six    2013   Jun     4.3      2.0